tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "puppetlabs/puppet"
cask "adoptopenjdk"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# New way to see and navigate directory trees
brew "broot"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Work on GitHub issues on the command-line
brew "ghi"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Add GitHub support to git on the command-line
brew "hub"
# X.509 and CMS library
brew "libksba"
# Generic library support script
brew "libtool"
# C++ bittorrent library with Python bindings
brew "libtorrent-rasterbar"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Remote CLI tool for Mattermost server
brew "mmctl"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# SQL powered operating system instrumentation and analytics
brew "osquery"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# x86 and PowerPC Emulator
brew "qemu"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# UNIX shell (command interpreter)
brew "zsh"
cask "pdk"
cask "transmission-remote-gui"
mas "Amphetamine", id: 937984704
mas "Apple Configurator 2", id: 1037126344
mas "Audiobook Builder", id: 1437681957
mas "com.dekorra.EazyDraw", id: 412624365
mas "CreateUserPkg", id: 540673598
mas "iStat Menus", id: 1319778037
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "NetSpot", id: 514951692
mas "Push Diagnostics", id: 689859502
mas "Remote Desktop", id: 409907375
mas "Save to Pocket", id: 1477385213
mas "Telegram", id: 747648890
mas "Twitter", id: 1482454543
mas "uBlock", id: 1385985095
mas "Xcode", id: 497799835
